---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IIFCImporterServer Methods
IIFCImporterServer Interface See Also Send Feedback
---

The IIFCImporterServer type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server.  (Inherited from IExternalServer.) |
|  | GetName | Implement this method to return the name of the server.  (Inherited from IExternalServer.) |
|  | GetServerId | Implement this method to return the id of the server.  (Inherited from IExternalServer.) |
|  | GetServiceId | Implement this method to return the id of the service.  (Inherited from IExternalServer.) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server.  (Inherited from IExternalServer.) |
|  | ImportIFC | The method that Revit will invoke to perform an import from IFC. |

# See Also

IIFCImporterServer Interface

Autodesk.Revit.DB.IFC Namespace